In [12]:
import pandas as pd

In [ ]:
df = pd.read_csv(r"C:\Users\ASUS\Downloads\delhi_aqi.csv\delhi_aqi.csv")
print(df.shape)
df.head(18776)

(18776, 9)

,date,co,no,no2,o3,so2,pm2_5,pm10,nh3
0,25-11-2020 01:00,2616.88,2.18,70.60,13.59,38.62,364.61,411.73,28.63
1,25-11-2020 02:00,3631.59,23.25,89.11,0.33,54.36,420.96,486.21,41.04
2,25-11-2020 03:00,4539.49,52.75,100.08,1.11,68.67,463.68,541.95,49.14
3,25-11-2020 04:00,4539.49,50.96,111.04,6.44,78.20,454.81,534.00,48.13
4,25-11-2020 05:00,4379.27,42.92,117.90,17.17,87.74,448.14,529.19,46.61
...,...,...,...,...,...,...,...,...,...
18771,24-01-2023 04:00,1762.39,4.64,37.01,33.26,30.52,231.15,289.84,6.27
18772,24-01-2023 05:00,1735.69,6.82,34.96,46.49,34.33,225.08,280.52,9.12
18773,24-01-2023 06:00,1922.61,8.16,40.10,56.51,43.39,242.49,296.07,12.54
18774,24-01-2023 07:00,1361.85,9.05,52.78,71.53,100.14,165.67,191.82,7.47
18775,24-01-2023 08:00,1134.87,8.61,56.89,80.11,110.63,123.76,140.26,5.51

In [ ]:
print("Duplicate columns:", df.columns[df.columns.duplicated()])
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")
df.columns

Duplicate columns: Index([], dtype='object')

Index(['date', 'co', 'no', 'no2', 'o3', 'so2', 'pm2_5', 'pm10', 'nh3'], dtype='object')

In [ ]:
missing = df.isnull().sum()
missing_percent = (missing / len(df)) * 100
missing_df = pd.DataFrame({
    "Missing_Count": missing,
    "Missing_Percent": missing_percent
}).sort_values(by="Missing_Percent", ascending=False)
missing_df

       Missing_Count  Missing_Percent
date               0              0.0
co                 0              0.0
no                 0              0.0
no2                0              0.0
o3                 0              0.0
so2                0              0.0
pm2_5              0              0.0
pm10               0              0.0
nh3                0              0.0

In [ ]:
duplicate_rows = df.duplicated().sum()
print("Duplicate rows:", duplicate_rows)
df[df.duplicated()]

Duplicate rows: 0

Empty DataFrame
Columns: [date, co, no, no2, o3, so2, pm2_5, pm10, nh3]
Index: []

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18776 entries, 0 to 18775
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    18776 non-null  object
 1   co      18776 non-null  float64
 2   no      18776 non-null  float64
 3   no2     18776 non-null  float64
 4   o3      18776 non-null  float64
 5   so2     18776 non-null  float64
 6   pm2_5   18776 non-null  float64
 7   pm10    18776 non-null  float64
 8   nh3     18776 non-null  float64
dtypes: float64(8), object(1)
memory usage: 1.3+ MB

In [ ]:
numeric_cols = df.select_dtypes(include=["int64", "float64"]).columns
df[numeric_cols].describe()

,co,no,no2,o3,so2,pm2_5,pm10,nh3
count,18776.000000,18776.000000,18776.000000,18776.000000,18776.000000,18776.000000,18776.000000,18776.000000
mean,2929.228628,33.660702,66.221299,60.346239,66.693633,238.130309,300.092966,25.109815
std,2854.523506,62.127118,48.527492,80.464932,49.439191,226.533625,267.165827,26.402108
min,260.350000,0.000000,4.280000,0.000000,5.250000,11.830000,15.070000,0.000000
25%,1068.120000,0.680000,33.930000,0.340000,34.810000,84.440000,118.797500,9.630000
50%,1842.500000,5.250000,54.150000,27.180000,52.930000,157.445000,209.705000,17.480000
75%,3685.000000,35.760000,83.630000,92.980000,82.020000,313.000000,387.965000,30.400000
max,21148.680000,500.680000,460.620000,801.090000,579.830000,1708.090000,1969.930000,287.770000

In [ ]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df['date'].isnull().sum()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_23700\266677595.py:2: UserWarning: Parsing dates in %d-%m-%Y %H:%M format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['date'] = pd.to_datetime(df['date'], errors='coerce')

np.int64(0)

In [23]:
clean_report = {
    "Rows": df.shape[0],
    "Columns": df.shape[1],
    "Duplicate_Rows": df.duplicated().sum(),
    "Total_Missing_Values": df.isnull().sum().sum(),
    "Columns_With_Missing": df.isnull().any().sum()
}

clean_report

{'Rows': 18776,
 'Columns': 9,
 'Duplicate_Rows': np.int64(0),
 'Total_Missing_Values': np.int64(0),
 'Columns_With_Missing': np.int64(0)}